# AllModelInstanceComments Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllModelInstanceComments Property
ParameterTypeId Class See Also
---
"Comments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllModelInstanceComments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllModelInstanceComments As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllModelInstanceComments {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace